In [1]:
import numpy as np
import pandas as pd

In [2]:
series = pd.Series([1,2,3,4])

In [3]:
series

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
series = series * 2

In [6]:
series

0    2
1    4
2    6
3    8
dtype: int64

In [7]:
series2 = pd.Series([1,2,3,4])

In [8]:
series

0    2
1    4
2    6
3    8
dtype: int64

In [9]:
series3 = series2 + series

In [10]:
series3

0     3
1     6
2     9
3    12
dtype: int64

In [11]:
series3.index = [0,1,'c',3]

In [12]:
series3.index

Index([0, 1, 'c', 3], dtype='object')

In [13]:
series.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
series4 = series + series3

In [15]:
series4

0     5.0
1    10.0
2     NaN
3    20.0
c     NaN
dtype: float64

In [17]:
series4.isnull()

0    False
1    False
2     True
3    False
c     True
dtype: bool

In [19]:
series4.notnull()

0     True
1     True
2    False
3     True
c    False
dtype: bool

In [22]:
series4.notnull().sum()

3

In [24]:
series4.isnull().sum()

2

In [25]:
pd.Series([1,2,3,4], dtype=float)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [35]:
dic = {'class name':['matric','inter','bsc','master'],
      'grade':['a','b','c','d'],
      'year':[122,32,4,3]}

In [27]:
dic

{'class': ['matric', 'inter', 'bsc', 'master'],
 'grade': ['a', 'b', 'c', 'd'],
 'year': [122, 32, 4, 3]}

In [28]:
df = pd.DataFrame(dic)

In [29]:
df

    class grade  year
0  matric     a   122
1   inter     b    32
2     bsc     c     4
3  master     d     3

In [33]:
df = pd.DataFrame(dic,columns=['year','grade','class'])

In [34]:
df

   year grade   class
0   122     a  matric
1    32     b   inter
2     4     c     bsc
3     3     d  master

In [36]:
df.year

0    122
1     32
2      4
3      3
Name: year, dtype: int64

In [37]:
df

   year grade   class
0   122     a  matric
1    32     b   inter
2     4     c     bsc
3     3     d  master

In [38]:
df = pd.DataFrame(dic)

In [39]:
df

  class name grade  year
0     matric     a   122
1      inter     b    32
2        bsc     c     4
3     master     d     3

In [41]:
df['class name']

0    matric
1     inter
2       bsc
3    master
Name: class name, dtype: object

In [43]:
df[['grade' ,'year']]

  grade  year
0     a   122
1     b    32
2     c     4
3     d     3

In [44]:
df[['class name','year']]

  class name  year
0     matric   122
1      inter    32
2        bsc     4
3     master     3

SyntaxError: invalid syntax (<ipython-input-45-14f0a882a6fd>, line 1)